Revit 2027 API
IFCExtrusionCreationData.ForceOffset Property
 True to create new local placement with identity transform.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ForceOffset { get; set; }
Public Property ForceOffset As Boolean
	Get
	Set
public:
property bool ForceOffset {
	bool get ();
	void set (bool value);
}
member ForceOffset : bool with get, set
Property Value
Boolean
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace